[
  {
    "id": 577922,
    "title": "Tenet",
    "description": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
    "date": "2020-08-22",
    "rating": 7.5,
    "image": "/k68nPLbIST6NP96JmTxmZijEvCA.jpg",
    "ranking": 1
  },
  {
    "id": 27205,
    "title": "Inception",
    "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
    "date": "2010-07-15",
    "rating": 8.3,
    "image": "/9gk7adHYeDvHkCSEqAvQNLV5Uge.jpg",
    "ranking": 2
  },
  {
    "id": 445571,
    "title": "Game Night",
    "description": "Max and Annie's weekly game night gets kicked up a notch when Max's brother Brooks arranges a murder mystery party -- complete with fake thugs and federal agents. So when Brooks gets kidnapped, it's all supposed to be part of the game. As the competitors set out to solve the case, they start to learn that neither the game nor Brooks are what they seem to be. The friends soon find themselves in over their heads as each twist leads to another unexpected turn over the course of one chaotic night.",
    "date": "2018-02-22",
    "rating": 6.8,
    "image": "/85R8LMyn9f2Lev2YPBF8Nughrkv.jpg",
    "ranking": 3
  },
  {
    "id": 1124,
    "title": "The Prestige",
    "description": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
    "date": "2006-10-19",
    "rating": 8.2,
    "image": "/pvSESD7ujxWZwtYDb9l57qE0ywq.jpg",
    "ranking": 4
  },
  {
    "id": 603,
    "title": "The Matrix",
    "description": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
    "date": "1999-03-30",
    "rating": 8.1,
    "image": "/dXNAPwY7VrqMAo51EKhhCJfaGb5.jpg",
    "ranking": 5
  },
  {
    "id": 278,
    "title": "The Shawshank Redemption",
    "description": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
    "date": "1994-09-23",
    "rating": 8.7,
    "image": "/5KCVkau1HEl7ZzfPsKAPM0sMiKc.jpg",
    "ranking": 6
  },
  {
    "id": 155,
    "title": "The Dark Knight",
    "description": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
    "date": "2008-07-16",
    "rating": 8.5,
    "image": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
    "ranking": 7
  },
  {
    "id": 299534,
    "title": "Avengers: Endgame",
    "description": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
    "date": "2019-04-24",
    "rating": 8.3,
    "image": "/or06FN3Dka5tukK1e9sl16pB3iy.jpg",
    "ranking": 8
  },
  {
    "id": 339403,
    "title": "Baby Driver",
    "description": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
    "date": "2017-06-28",
    "rating": 7.5,
    "image": "/dN9LbVNNZFITwfaRjl4tmwGWkRg.jpg",
    "ranking": 9
  },
  {
    "id": 313369,
    "title": "La La Land",
    "description": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
    "date": "2016-11-29",
    "rating": 7.9,
    "image": "/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg",
    "ranking": 10
  },
  {
    "id": 74465,
    "title": "We Bought a Zoo",
    "description": "Benjamin has lost his wife and, in a bid to start his life over, purchases a large house that has a zoo – welcome news for his daughter, but his son is not happy about it. The zoo is in need of renovation and Benjamin sets about the work with the head keeper and the rest of the staff, but, the zoo soon runs into financial trouble.",
    "date": "2011-12-08",
    "rating": 6.7,
    "image": "/dcOvIqdsojUdAtWt1nPT9xS76Su.jpg",
    "ranking": 11
  },
  {
    "id": 597,
    "title": "Titanic",
    "description": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
    "date": "1997-11-18",
    "rating": 7.9,
    "image": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
    "ranking": 12
  },
  {
    "id": 19995,
    "title": "Avatar",
    "description": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
    "date": "2009-12-10",
    "rating": 7.4,
    "image": "/6EiRUJpuoeQPghrs3YNktfnqOVh.jpg",
    "ranking": 13
  },
  {
    "id": 82992,
    "title": "Fast & Furious 6",
    "description": "Hobbs has Dominic and Brian reassemble their crew to take down a team of mercenaries: Dominic unexpectedly gets convoluted also facing his presumed deceased girlfriend, Letty.",
    "date": "2013-05-21",
    "rating": 6.8,
    "image": "/n31VRDodbaZxkrZmmzyYSFNVpW5.jpg",
    "ranking": 14
  },
  {
    "id": 673,
    "title": "Harry Potter and the Prisoner of Azkaban",
    "description": "Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black—and turns to sympathetic Professor Lupin for help.",
    "date": "2004-05-31",
    "rating": 8,
    "image": "/v0wMKEEGaNc9evdqGYfIvoWXh24.jpg",
    "ranking": 15
  },
  {
    "id": 315635,
    "title": "Spider-Man: Homecoming",
    "description": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
    "date": "2017-07-05",
    "rating": 7.4,
    "image": "/c24sv2weTHPsmDa7jEMN0m2P3RT.jpg",
    "ranking": 16
  },
  {
    "id": 166428,
    "title": "How to Train Your Dragon: The Hidden World",
    "description": "As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless’ discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup’s reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.",
    "date": "2019-01-03",
    "rating": 7.8,
    "image": "/xvx4Yhf0DVH8G4LzNISpMfFBDy2.jpg",
    "ranking": 17
  }
]
